import lang from "./resourse";

const itemRawDataZHTW = {
  '香菇菌種': '菌種加工機、雜貨店',
  '鴻喜菇菌種': '菌種加工機、雜貨店',
  '杏鮑菇菌種': '菌種加工機、雜貨店',
  '粉紅珊瑚菇菌種': '菌種加工機、雜貨店',
  '蘑菇菌種': '菌種加工機、雜貨店',
  '松茸菌種': '菌種加工機、雜貨店',
  '香菇': '區域2採集全年、食材店',
  '鴻喜菇': '區域2採集全年、食材店',
  '杏鮑菇': '區域3採集全年、食材店',
  '粉紅珊瑚菇': '區域3採集全年、食材店',
  '蘑菇': '碎石山谷全年、食材店',
  '松茸': '伐木採集（全年）',

  '乾草飼料': '栽培、照顧可樂波、雜貨店',
  '釣餌素材': '釣魚可樂波、雜貨店',

  '閃電熔結岩': '區域1小積水、可樂商店運氣',
  '水砷鐵銅石': '區域2小積水、可樂商店碰運氣',
  '橄欖結晶': '區域3小積水、可樂商店碰運氣',

  '月落草': '可樂商店',
  '粉色貓薄荷': '可樂商店',
  '魔法藍草': '可樂商店',
  '魔法紅草': '可樂商店',
  '奧勒岡葉': '可樂商店',
  '鼠尾草': '可樂商店',
  '芳香萬壽菊': '可樂商店',
  '金雨迷迭香': '可樂商店',
  '野莓': '可樂商店',
  '紫萁': '可樂商店',
  '款冬': '可樂商店',
  '筆頭菜': '可樂商店',
  '栗子': '可樂商店',
  '竹筍': '可樂商店',
  '黏土': '可樂商店',
  '原木': '可樂商店',
  '堅硬的原木': '可樂商店',
  '柔韌的原木': '可樂商店',
  '粗壯的原木': '可樂商店',
  '夢幻原木': '可樂商店',
  '樹汁': '可樂商店',
  '草': '可樂商店',
  '柔韌的草': '可樂商店',
  '堅韌的草': '可樂商店',
  '觸感柔滑的草': '可樂商店',
  '夢幻草': '可樂商店',
  '石頭': '可樂商店',
  '玻璃石': '可樂商店',
  '石炭塊': '可樂商店',
  '鐵礦石': '可樂商店',
  '銀礦石': '可樂商店',
  '金礦石': '可樂商店',
  '奧利哈鋼礦石': '可樂商店',

  '紅色染料': '花店',
  '藍色染料': '花店',
  '綠色染料': '花店',
  '黃色染料': '花店',
  '白色染料': '花店',

  '岩鹽': '區域3海邊',
  '鹽': '調味料加工機 放入 岩鹽',
  '醋': '液體調味料加工機 放入 稻米',
  '醬油': '液體調味料加工機 放入 豆子',
  '麵粉': '粉末加工機 放入 小麥',
  '奶油': '奶油加工機 放入 牛奶',
  '起司': '起司加工機 放入 牛奶',

};

const itemRawData = [];
for (const [key, value] of Object.entries(itemRawDataZHTW)) {
  itemRawData.push({
    key,
    name: lang(key),
    way: value,
  })
}
export default itemRawData;