const giftrawDataV1 = [
  {
    "name": "維克多",
    "description": "鎮長",
    "first": [
      "珠寶哈密瓜",
      "發光手錶"
    ],
    "second": [
      "哈密瓜",
      "拌飯",
      "松茸",
      "玉米",
      "白米",
      "哈密瓜果醬"
    ],
    "third": [
      "花香香水",
      "春風行進曲",
      "珠寶戒指",
      "營火",
      "氣派的路燈",
      "豪華路燈",
      "木製長椅",
      "鐵製長椅"
    ],
    "fourth": [
      "蕪菁種子",
      "哈密瓜種子",
      "稻米",
      "牛奶",
      "石頭",
      "玻璃石"
    ],
    "gender": "M"
  },
  {
    "name": "雅科波",
    "description": "橄欖鎮吉祥物",
    "first": [
      "鑽石",
      "巨型海鮮比薩",
      "發光手錶"
    ],
    "second": [
      "義大利漁夫麵",
      "青醬義大利麵",
      "披薩",
      "蔬食披薩",
      "珠寶墜子"
    ],
    "third": [
      "果香香水",
      "魅惑香水",
      "春風三月",
      "炎帝華爾茲",
      "珠寶戒指"
    ],
    "fourth": [
      "高麗菜",
      "洋蔥",
      "雞蛋",
      "牛奶"
    ],
    "gender": "M"
  },
  {
    "name": "葛爾克",
    "description": "船長",
    "first": [
      "心型菠菜",
      "頂級雞蛋",
      "頂級烏骨雞雞蛋",
      "雞蛋沙拉"
    ],
    "second": [
      "雞蛋",
      "烏骨雞雞蛋",
      "羊毛毛料",
      "馬鈴薯沙拉",
      "荷包蛋"
    ],
    "third": [
      "羊毛",
      "頂級羊毛",
      "綿羊線"
    ],
    "fourth": [
      "蘿蔔種子",
      "馬鈴薯種子",
      "洋蔥",
      "牛奶"
    ],
    "gender": "M"
  },
  {
    "name": "奈吉爾",
    "description": "木匠",
    "first": [
      "發光手錶"
    ],
    "second": [
      "果醬三明治",
      "蔬菜三明治",
      "雞蛋三明治",
      "鮪魚三明治"
    ],
    "third": [
      "木材加工機",
      "絲線加工機",
      "金屬塊加工機",
      "磚頭加工機",
      "巨型木材製造機"
    ],
    "fourth": [
      "毛料製造機",
      "布料加工機",
      "優格加工機"
    ],
    "gender": "M"
  },
  {
    "name": "傑森",
    "description": "旅店老闆",
    "first": [
      "老舊的羅盤",
      "老舊的地圖"
    ],
    "second": [
      "扶桑花",
      "椰子",
      "餅乾",
      "杏仁餅乾",
      "珠寶墜子",
      "時髦手環",
      "發光手錶"
    ],
    "third": [
      "花香香水",
      "百花香水",
      "果香香水",
      "春風進行曲",
      "珠寶戒指"
    ],
    "fourth": [
      "哈密瓜種子",
      "扶桑花種子",
      "美式鬆餅",
      "布丁"
    ],
    "gender": "M"
  },
  {
    "name": "麥奇",
    "description": "小胖子",
    "first": [
      "香蕉"
    ],
    "second": [
      "日式拿坡里義大利麵",
      "披薩",
      "地瓜燒",
      "美式鬆餅",
      "可可亞",
      "閃電熔結岩",
      "水砷鐵銅石",
      "橄欖結晶",
      "獨角仙雕像(ヤマトカブトムシの像)"
    ],
    "third": [
      "玻璃石",
      "鐵礦石",
      "銀礦石",
      "金礦石",
      "奧利哈鋼礦石",
      "烤蘋果",
      "蜂蜜酸奶"
    ],
    "fourth": [
      "石頭",
      "醃漬小魚",
      "醃漬香菇",
      "酸黃瓜"
    ],
    "gender": "M"
  },
  {
    "name": "克萊門斯",
    "description": "升級工具和做背包的",
    "first": [
      "芬蘭甜菜沙拉",
      "栗子飯",
      "蒙布朗",
      "發光手錶"
    ],
    "second": [
      "大蒜",
      "奧利哈鋼礦石",
      "酸黃瓜",
      "燉馬鈴薯",
      "蒜味辣椒義大利麵",
      "栗子最中餅"
    ],
    "third": [
      "金屬塊加工機",
      "珠寶加工機",
      "栗子",
      "日式煮魚",
      "腐皮烏冬面"
    ],
    "fourth": [
      "蕃薯",
      "絲線加工機",
      "毛線加工機",
      "優格製造機"
    ],
    "gender": "M"
  },
  {
    "name": "拉修",
    "description": "機車男",
    "first": [
      "栗子飯",
      "披薩",
      "蒙布朗",
      "魅惑香水",
      "時髦手環",
      "發光手錶"
    ],
    "second": [
      "芬蘭甜菜沙拉",
      "蔬食披薩",
      "栗子最中餅",
      "珠寶戒指",
      "珠寶墜子"
    ],
    "third": [
      "栗子",
      "花香香水",
      "百花香水",
      "春風進行曲"
    ],
    "fourth": [
      "牛奶",
      "雞蛋",
      "歐姆蛋",
      "茄汁焗豆",
      "蚌殼湯"
    ],
    "gender": "M"
  },
  {
    "name": "賽門",
    "description": "牛仔帽老爺爺",
    "first": [
      "田園野菇派",
      "布丁",
      "時髦手環",
      "發光手錶"
    ],
    "second": [
      "粉蝶花",
      "香菇",
      "鴻喜菇",
      "松茸",
      "醃漬香菇",
      "蜂蜜布丁",
      "咖啡布丁"
    ],
    "third": [
      "蜂窩蜜",
      "工蜂乳",
      "蜂王漿",
      "春風進行曲",
      "珠寶戒指"
    ],
    "fourth": [
      "牛奶",
      "雞蛋",
      "洋蔥",
      "蜂蜜地瓜燒"
    ],
    "gender": "M"
  },
  {
    "name": "關",
    "description": "花店爺爺",
    "first": [
      "神秘的魚餌"
    ],
    "second": [
      "ヌシ釣りエサ",
      "泰式涼拌冬粉沙拉",
      "韓式年糕湯",
      "三種牡丹餅"
    ],
    "third": [
      "鬱金香",
      "向日葵種子",
      "小型魚釣餌",
      "大型魚釣餌"
    ],
    "fourth": [
      "粉蝶花",
      "沙丁魚",
      "鯖魚"
    ],
    "gender": "M"
  },
  {
    "name": "馬可斯",
    "description": "漁夫爸爸",
    "first": [
      "巨型地瓜",
      "巨大海鮮披薩",
      "堅果瑪芬蛋糕"
    ],
    "second": [
      "蕃薯",
      "拿波里水煮魚",
      "鯛魚生魚片",
      "意大利漁夫麵",
      "楓糖瑪芬蛋糕"
    ],
    "third": [
      "醃漬小魚",
      "蚌殼湯",
      "蛤蜊巧達濃湯",
      "捕魚網"
    ],
    "fourth": [
      "蕃薯種子",
      "馬鈴薯",
      "沙丁魚",
      "柳葉魚",
      "竹莢魚"
    ],
    "gender": "M"
  },
  {
    "name": "勞爾",
    "description": "漁夫小弟",
    "first": [
      "香蕉",
      "美乃滋",
      "香蕉牛奶",
      "香蕉果醬",
      "時髦手環"
    ],
    "second": [
      "美乃滋加工機",
      "醃漬小魚",
      "拿波里水煮魚",
      "意大利漁夫麵",
      "珠寶墜子"
    ],
    "third": [
      "蚌殼湯",
      "馬賽魚湯",
      "烤魚",
      "日式煮魚",
      "捕魚網"
    ],
    "fourth": [
      "牛奶",
      "雞蛋",
      "沙丁魚",
      "柳葉魚",
      "竹莢魚"
    ],
    "gender": "M"
  },
  {
    "name": "道節",
    "description": "少主侍從",
    "first": [
      "巨大的蔥",
      "飯糰",
      "栗子最中餅"
    ],
    "second": [
      "蔥",
      "乒乓菊",
      "醬油",
      "蚌殼湯",
      "日式蔬菜豆腐湯"
    ],
    "third": [
      "稻米",
      "茶葉",
      "樹汁",
      "紫萁",
      "板栗",
      "紅豆麻糬湯",
      "白飯",
      "珠寶戒指"
    ],
    "fourth": [
      "蕪菁",
      "蘿蔔",
      "小麥",
      "豆子",
      "鹽",
      "胡椒",
      "糖",
      "醋"
    ],
    "gender": "M"
  },
  {
    "name": "諾曼",
    "description": "食材店地中海",
    "first": [
      "金蘋果",
      "神秘魚餌",
      "烤蘋果",
      "蘋果汁",
      "蘋果果醬"
    ],
    "second": [
      "蘋果",
      "神秘的魚餌",
      "馬鈴薯沙拉",
      "芬蘭甜菜沙拉",
      "時髦手環",
      "發光手錶"
    ],
    "third": [
      "可可亞",
      "牛奶",
      "小型魚釣餌",
      "各種調味料"
    ],
    "fourth": [
      "蕪菁",
      "洋蔥",
      "蒜",
      "菠蘿",
      "沙丁魚"
    ],
    "gender": "M"
  },
  {
    "name": "最喜番",
    "description": "孤獨的美食家",
    "first": [
      "義式番茄起司沙拉",
      "拿波里水煮魚",
      "香菇",
      "飯團"
    ],
    "second": [
      "巨型蘿蔔",
      "星狀馬鈴薯",
      "義式蔬菜湯",
      "番茄汁",
      "時髦手環"
    ],
    "third": [
      "頂級牛奶",
      "醃漬小魚",
      "蚌殼湯",
      "烤魚"
    ],
    "fourth": [
      "蘿蔔",
      "馬鈴薯",
      "高麗菜",
      "酸黃瓜",
      "白飯"
    ],
    "gender": "M"
  },
  {
    "name": "葛洛莉雅",
    "description": "村長太太",
    "first": [
      "金色草莓",
      "百花香水",
      "大地協奏曲",
      "珠寶墜子"
    ],
    "second": [
      "草莓",
      "報春花",
      "紅寶石",
      "糖漬水果",
      "草莓牛奶",
      "草莓醬"
    ],
    "third": [
      "白色蛋白石",
      "時髦手環",
      "閃電熔結岩"
    ],
    "fourth": [
      "草莓種子",
      "哈密瓜",
      "鬱金香",
      "奧利哈鋼礦石"
    ],
    "gender": "F"
  },
  {
    "name": "派翠西亞",
    "description": "動物屋店長",
    "first": [
      "黃金桃子",
      "月夜夜曲",
      "珠寶墜子"
    ],
    "second": [
      "矮牽牛",
      "桃子",
      "蜂蜜",
      "蜂巢蜜",
      "工蜂乳",
      "蜂王漿"
    ],
    "third": [
      "兔子毛",
      "兔子毛（灰色）",
      "兔子毛（粉色）",
      "寵物零食",
      "軟軟球"
    ],
    "fourth": [
      "柳橙",
      "杏仁",
      "檸檬",
      "羊毛",
      "薩福克羊羊毛"
    ],
    "gender": "F"
  },
  {
    "name": "莎莉",
    "description": "咖啡廳貴婦",
    "first": [
      "柳橙果醬",
      "百花香水",
      "珠寶戒指"
    ],
    "second": [
      "鐵線蓮",
      "黑玫瑰",
      "柳橙",
      "紅寶石",
      "美式鬆餅",
      "柳橙汁",
      "茶"
    ],
    "third": [
      "奧勒岡葉",
      "鼠尾草",
      "檸檬",
      "萬壽菊",
      "金雨迷迭香",
      "春風進行曲"
    ],
    "fourth": [
      "黑玫瑰種子",
      "高麗菜",
      "小黃瓜",
      "洋蔥"
    ],
    "gender": "F"
  },
  {
    "name": "貝絲",
    "description": "紅毛雙馬尾眼鏡娘",
    "first": [
      "發光手錶",
      "古代飾品",
      "老舊的鏡子",
      "橄欖水晶",
      "閃電熔結岩"
    ],
    "second": [
      "富貴菊",
      "泡菜",
      "酸辣湯",
      "泡菜鍋",
      "咖哩飯",
      "時髦手環"
    ],
    "third": [
      "珠寶戒指",
      "珠寶墜子"
    ],
    "fourth": [
      "辣椒",
      "玻璃石",
      "紅寶石"
    ],
    "gender": "F"
  },
  {
    "name": "美紗希",
    "description": "小餐館美魔女",
    "first": [
      "醃漬小魚",
      "醃漬香菇",
      "百花香水",
      "魅惑香水",
      "月夜夜曲",
      "雪花輪舞曲"
    ],
    "second": [
      "百合",
      "檸檬",
      "紅寶石",
      "奶油",
      "提拉米蘇",
      "花香香水",
      "珠寶戒指"
    ],
    "third": [
      "沙丁魚",
      "柳葉魚",
      "鹽",
      "辣椒",
      "面粉",
      "起司"
    ],
    "fourth": [
      "馬鈴薯",
      "洋蔥",
      "稻米",
      "小麥",
      "豆子",
      "茶葉"
    ],
    "gender": "F"
  },
  {
    "name": "潔西",
    "description": "老婆婆",
    "first": [
      "蜂王漿",
      "蜂蜜布丁",
      "雪花輪舞曲"
    ],
    "second": [
      "陸蓮花",
      "蜂巢蜜",
      "工蜂乳",
      "蜂蜜酸奶",
      "蜂蜜番薯",
      "布丁"
    ],
    "third": [
      "香菇",
      "蜂蜜巢蜜",
      "蜂巢巢蜜",
      "石頭",
      "白色蛋白石",
      "花香香水"
    ],
    "fourth": [
      "陸蓮花種子",
      "玻璃石",
      "蕃薯"
    ],
    "gender": "F"
  },
  {
    "name": "安琪拉",
    "description": "雜貨店老闆娘",
    "first": [
      "咖啡布丁",
      "春風進行曲",
      "時髦手環"
    ],
    "second": [
      "風鈴草",
      "櫻桃",
      "藍寶石",
      "鹽",
      "胡椒",
      "糖",
      "布丁",
      "蜂蜜布丁"
    ],
    "third": [
      "羊毛",
      "薩福克羊羊毛",
      "奶油",
      "起司",
      "美乃滋",
      "優格",
      "毛線加工機",
      "布料加工機"
    ],
    "fourth": [
      "稻米",
      "小麥",
      "豆子",
      "茶葉",
      "蜂蜜",
      "蜂蜜巢蜜",
      "咖啡"
    ],
    "gender": "F"
  },
  {
    "name": "辛蒂",
    "description": "小女孩",
    "first": [
      "櫻桃冷湯",
      "蜂蜜布丁",
      "優格乳",
      "櫻桃果醬",
      "春風進行曲"
    ],
    "second": [
      "鬱金香",
      "櫻桃",
      "優格",
      "菠菜泥優格沙拉",
      "布丁",
      "咖啡布丁"
    ],
    "third": [
      "羊毛",
      "薩福克羊羊毛",
      "草莓牛奶",
      "香蕉牛奶"
    ],
    "fourth": [
      "櫻桃幼苗",
      "粉蝶花",
      "三色蓳",
      "香蕉",
      "蜂蜜"
    ],
    "gender": "F"
  },
  {
    "name": "曼紐拉",
    "description": "漁夫太太",
    "first": [
      "葡萄牙海鮮銅鍋料理",
      "水果歐蕾",
      "鳯梨果醬",
      "百花香水",
      "珠寶墜子"
    ],
    "second": [
      "鳯梨",
      "秋海棠",
      "祖母綠",
      "醃漬小魚",
      "意大利漁夫麵",
      "義式奶酪"
    ],
    "third": [
      "龍宮湯",
      "蚌殼湯",
      "烤魚",
      "日式煮魚",
      "捕魚網"
    ],
    "fourth": [
      "牛奶",
      "沙丁魚",
      "柳葉魚",
      "竹莢魚",
      "珠星三塊魚",
      "鯡魚",
      "鰻魚"
    ],
    "gender": "F"
  },
  {
    "name": "席尼",
    "description": "女強人",
    "first": [
      "優格",
      "葡萄汁",
      "葡萄果醬",
      "百花香水",
      "炎帝華爾茲",
      "發光手錶"
    ],
    "second": [
      "黑玫瑰",
      "葡萄",
      "鑽石",
      "バナジェッツ",
      "番茄汁",
      "花香香水"
    ],
    "third": [
      "可可豆",
      "祖母綠",
      "芬蘭甜菜沙拉",
      "茶"
    ],
    "fourth": [
      "柳橙",
      "杏仁",
      "檸檬",
      "牛奶",
      "烏骨雞雞蛋"
    ],
    "gender": "F"
  },
  {
    "name": "卡琳娜",
    "description": "黑皮設計師",
    "first": [
      "巨型鱷梨",
      "花束香水",
      "果味香水",
      "大地協奏曲",
      "時髦手環"
    ],
    "second": [
      "黑色三色堇",
      "紅寶石",
      "義式番茄起司沙拉",
      "青醬義大利麵",
      "茶",
      "花香香水"
    ],
    "third": [
      "鱷梨",
      "藍寶石",
      "蔬菜沙拉",
      "醃漬小魚"
    ],
    "fourth": [
      "鱷梨幼苗",
      "洋蔥",
      "草莓",
      "玫瑰",
      "茶葉"
    ],
    "gender": "F"
  },
  {
    "name": "琴",
    "description": "美容師",
    "first": [
      "拉明頓蛋糕",
      "摩卡",
      "花香香水",
      "百花香水",
      "果香香水"
    ],
    "second": [
      "三色蓳",
      "祖母綠",
      "可可粉",
      "巧克力蛋糕",
      "提拉米蘇",
      "巧克力曲奇",
      "可可亞"
    ],
    "third": [
      "鱷梨",
      "巨大鱷梨",
      "可可豆",
      "紅寶石",
      "藍寶石"
    ],
    "fourth": [
      "可可幼苗",
      "白色蛋白石",
      "美式鬆餅",
      "餅乾"
    ],
    "gender": "F"
  }
];

const giftrawData = [];

giftrawDataV1.forEach(role => {
  const roleData = {
    name: role.name,
    description: role.description,
    gender: role.gender,
    gifts: [],
  }

  role.first.forEach(gift => {
    roleData.gifts.push({'name': gift, 'level': 1});
  });
  role.second.forEach(gift => {
    roleData.gifts.push({'name': gift, 'level': 2});
  });
  role.third.forEach(gift => {
    roleData.gifts.push({'name': gift, 'level': 3});
  });
  role.fourth.forEach(gift => {
    roleData.gifts.push({'name': gift, 'level': 4});
  });

  giftrawData.push(roleData);
})

export default giftrawData;